import com.alibaba.fastjson.JSONObject;
import com.smzdm.entity.ImpLogEntity;
import org.junit.Test;

/**
 * @author: liuchen
 * @date: 2019/2/22
 * @time: 5:31 PM
 * @Description:
 */
public class UtilTest {

    @Test
    public void testDate() {
        String s = "{\"imei\":\"\",\"aid\":\"com.smzdm.client.ios\",\"lng\":\"118.653071591556\",\"sid\":\"15508276125279\",\"uid\":\"3127437642\",\"tid\":\"UA-1000000-1\",\"an\":\"smzdm\",\"ca\":\"2\",\"sr\":\"1125x2436\",\"ea\":\"01\",\"uuid\":\"33E88920-0264-4E1B-B803-38D62A79DEA2\",\"ecp\":\"{\\\"p\\\":\\\"71\\\",\\\"sit\\\":\\\"1550827736624\\\",\\\"c\\\":\\\"5\\\",\\\"oos\\\":\\\"无\\\",\\\"25\\\":\\\"精选\\\",\\\"11\\\":\\\"haitao\\\",\\\"tagID\\\":\\\"无\\\",\\\"1\\\":\\\"REEBONZ中国官方商城\\\",\\\"sp\\\":\\\"0\\\",\\\"ct\\\":\\\"24小时内-非同步到首页的国内\\\\\\/海淘数据\\\",\\\"13\\\":\\\"x\\\",\\\"tv\\\":\\\"x\\\",\\\"14\\\":\\\"32a7845156db258d97e17de83bf53c86\\\",\\\"atp\\\":\\\"3\\\",\\\"22\\\":\\\"同步到首页\\\",\\\"5\\\":\\\"服饰鞋包\\\",\\\"ref\\\":\\\"启动APP\\\",\\\"6\\\":\\\"男包\\\",\\\"pid\\\":\\\"32a7845156db258d97e17de83bf53c86\\\",\\\"7\\\":\\\"男士单肩包\\\",\\\"ad\\\":\\\"2\\\",\\\"8\\\":\\\"无\\\",\\\"a\\\":\\\"12746195\\\",\\\"24\\\":\\\"普通\\\",\\\"9\\\":\\\"LOEWE\\\\\\/罗意威\\\"}\",\"idfa\":\"6sNOuaCNl9d9DmXzhA9opM6K\\/flojAPSj0LZ2BQXzszSVGfFbpryfQ==\",\"ec\":\"01\",\"type\":\"show\",\"ift\":\"0\",\"st\":\"iPhone\",\"v\":\"1.10\",\"ip\":\"121.225.199.32, 122.228.238.75\",\"sv\":\"1.1.0\",\"dt\":\"1\",\"ds\":\"app\",\"m\":\"d9742a45fd7846b3959c6d353891a8d7\",\"ch\":\"AppStore\",\"slt\":1550827764,\"av\":\"9.3.11\",\"it\":\"1550827736627\",\"cid\":\"QB51QR0T6bpCwppzn0iuQ9BkPe75h9Clb0aS6Ha85CeMDvszhDzdkA==.1534474805862\",\"lat\":\"31.93674825180165\",\"os\":\"12.1.4\",\"did\":\"QB51QR0T6bpCwppzn0iuQ9BkPe75h9Clb0aS6Ha85CeMDvszhDzdkA==\",\"hnb\":\"90\",\"dm\":\"iPhone10,3\",\"idf{\"el\":\"评论\",\"imei\":\"11da54fd9b7313516672d1acdcf5b657\",\"aid\":\"com.smzdm.client.android\",\"lng\":\"114.877098\",\"sid\":\"15508272257037917\",\"mac\":\"EC:D0:9F:3F:63:D4uuid=f0acc7a1-dceb-4a6c-87a9-92e66d8e8000\",\"tid\":\"UA-1000000-2\",\"an\":\"smzdm\",\"ltp\":0,\"ca\":\"1\",\"anid\":\"19adaa71f89f7e2391cd31d9a9097622\",\"sr\":\"1080*1920\",\"ea\":\"详情页_底部导航点击_底栏操作\",\"hnb\":\"155\",\"ec\":\"好价\",\"type\":\"event\",\"ift\":\"0\",\"st\":\"android\",\"id\":232199,\"nd\":\"11da54fd9b7313516672d1acdcf5b657\",\"v\":\"1.10\",\"ip\":\"39.177.168.150, 111.13.147.208\",\"sv\":\"1.10\",\"dt\":\"2\",\"ds\":\"app\",\"ch\":\"xiaomi\",\"av\":\"9.3.11\",\"it\":\"1550827753243\",\"os\":\"7.1.1\",\"lat\":\"25.786899\",\"slt\":1550827764,\"did\":\"441083a8ea4f148e6127968b52a192cb\",\"nt\":\"wifi\",\"cid\":\"441083a8ea4f148e6127968b52a192cb.1537255893058\",\"uid\":\"2632377494\",\"dm\":\"Mi Note 3\"}";
        ImpLogEntity entity = JSONObject.parseObject(s, ImpLogEntity.class);
        System.out.println(entity);
    }
}
